{
  "'{0}' is not an executable project.": "« {0} » n’est pas un projet exécutable.",
  "'{0}' request is not supported for the '{1}' configuration.": "La requête « {0} » n’est pas prise en charge pour la configuration « {1} ».",
  "'{0}' was not provided in the debug configuration.": "« {0} » n’a pas été fourni dans la configuration de débogage.",
  "'{0}' was not set in the debug configuration.": "« {0} » n’a pas été défini dans la configuration de débogage.",
  ".NET NuGet Restore": "Restauration de .NET NuGet",
  ".NET Test Log": "Journal des tests .NET",
  ".NET: Generate Assets for Build and Debug": ".NET : générer des ressources pour la génération et le débogage",
  "A valid dotnet installation could not be found: {0}": "Une installation dotnet valide est introuvable : {0}",
  "Active File Context": "Contexte de fichier actif",
  "Actual behavior": "Comportement réel",
  "An error occurred during installation of the .NET Debugger. The C# extension may need to be reinstalled.": "Une erreur s’est produite lors de l’installation du débogueur .NET. L’extension C# doit peut-être être réinstallée.",
  "Author": "Auteur",
  "Bug": "Bogue",
  "C# Activation Status": "C# État d’activation",
  "C# LSP Trace Logs": "Journaux de suivi C# LSP",
  "C# Project Context Status": "État du contexte du projet C#",
  "C# Workspace Status": "État de l’espace de travail C#",
  "C# configuration has changed. Would you like to relaunch the Language Server with your changes?": "La configuration C# a changé. Voulez-vous relancer le serveur de langage avec vos modifications ?",
  "C# configuration has changed. Would you like to reload the window to apply your changes?": "La configuration C# a changé. Voulez-vous recharger la fenêtre pour appliquer vos modifications ?",
  "Can not find an opened workspace folder. Please open a folder before starting to debug with a '{0}' configuration'.": "Impossible de trouver un dossier d’espace de travail ouvert. Ouvrez un dossier avant de commencer à déboguer avec une configuration « {0} ».",
  "Can't parse envFile {0} because of {1}": "Impossible d’analyser envFile {0} en raison de {1}",
  "Cancel": "Annuler",
  "Cannot create .NET debug configurations. No workspace folder was selected.": "Impossible de créer des configurations de débogage .NET. Aucun dossier d’espace de travail n’a été sélectionné.",
  "Cannot create .NET debug configurations. The active C# project is not within folder '{0}'.": "Impossible de créer des configurations de débogage .NET. Le projet C# actif ne se trouve pas dans le dossier « {0} ».",
  "Cannot create .NET debug configurations. The server is still initializing or has exited unexpectedly.": "Impossible de créer des configurations de débogage .NET. Le serveur est toujours en cours d’initialisation ou s’est arrêté de manière inattendue.",
  "Cannot load Razor OmniSharp language server because the directory was not found: '{0}'": "Impossible de charger le serveur de langage Razor OmniSharp car le répertoire est introuvable : « {0} »",
  "Cannot resolve .NET debug configurations. The server is still initializing or has exited unexpectedly.": "Impossible de résoudre les configurations de débogage .NET. Le serveur est toujours en cours d’initialisation ou s’est arrêté de manière inattendue.",
  "Cannot start collecting Razor logs when {0} is set to {1}. Please open the output window, choose the \"Razor Log\", and use the gear icon to ensure the log level is set to \"Debug\" or \"Trace\".": "Impossible de démarrer la collecte des journaux Razor lorsque {0} est défini sur {1}. Veuillez ouvrir la fenêtre de sortie, choisir « Journal Razor », et utiliser l’icône d’engrenage pour vous assurer que le niveau de journal est réglé sur « Débogage » ou « Trace ».",
  "Choose": "Choisir",
  "Choose and set default": "Choisir et définir la valeur par défaut",
  "Click {0}. This will copy all relevant issue information.": "Cliquez sur {0}. Cette opération copie toutes les informations pertinentes sur le problème.",
  "Configuration \"{0}\" in launch.json does not have a {1} argument with {2} for remote process listing.": "La configuration « {0} » dans launch.json n’a pas d’argument {1} avec {2} pour la liste des processus distants.",
  "Copy issue content again": "Copier à nouveau le contenu du problème",
  "Could not determine CSharp content": "Impossible de déterminer le contenu CSharp",
  "Could not determine CSharp content: {0}": "Impossible de déterminer le contenu CSharp : {0}",
  "Could not determine Html content": "Impossible de déterminer le contenu HTML",
  "Could not find '{0}' in or above '{1}'.": "Impossible de trouver '{0}' dans ou au-dessus '{1}'.",
  "Could not find a process id to attach.": "Impossible de trouver un ID de processus à joindre.",
  "Could not locate .NET Core project in '{0}'. Assets were not generated.": "Impossible de localiser le projet .NET Core dans '{0}'. Les actifs n'ont pas été générés.",
  "Couldn't create self-signed certificate. See output for more information.": "Impossible de créer un certificat auto-signé. Pour plus d’informations, consultez la sortie.",
  "Couldn't create self-signed certificate. {0}\r\ncode: {1}\r\nstdout: {2}": "Impossible de créer un certificat auto-signé. {0}\r\ncode : {1}\r\nstdout : {2}",
  "Description of the problem": "Description du problème",
  "Detected change in telemetry settings. These will not take effect until the language server is restarted, would you like to restart?": "Détection d’une modification des paramètres de télémétrie. Celles-ci ne prendront effet qu’après le redémarrage du serveur de langue. Voulez-vous redémarrer ?",
  "Disable message in settings": "Désactiver le message dans les paramètres",
  "Dismiss": "Ignorer",
  "Do not load any": "Ne charger aucun",
  "Do not show for this workspace": "Ne pas afficher pour cet espace de travail",
  "Does not contain .NET Core projects.": "Ne contient pas de projets .NET Core.",
  "Don't Ask Again": "Ne plus me poser la question",
  "Download Mono": "Télécharger Mono",
  "Enable launching a web browser when ASP.NET Core starts. For more information: {0}": "Activez le lancement d’un navigateur web au démarrage de ASP.NET Core. Pour plus d’informations : {0}",
  "Enter dotnet-trace arguments/dotnet-trace is a command name and should not be localized": "Entrez les arguments de dotnet-trace",
  "Error Message: ": "Message d'erreur : ",
  "Expand": "Développer",
  "Expected behavior": "Comportement attendu",
  "Extension": "Extension",
  "Extensions": "Extensions",
  "Failed to complete the installation of the C# extension. Please see the error in the output window below.": "Échec de l’installation de l’extension C#. Consultez l’erreur dans la fenêtre sortie ci-dessous.",
  "Failed to execute dotnet-trace command: {0}/dotnet-trace is a command name and should not be localized": "Échec de l’exécution de la commande dotnet-trace : {0}",
  "Failed to install dotnet-trace, it may need to be manually installed. See C# output for details./dotnet-trace is a command name and should not be localized": "Échec de l’installation de dotnet-trace, vous devrez peut-être l’installer manuellement. Consultez la sortie C# pour plus de détails.",
  "Failed to parse tasks.json file: {0}": "Échec de l'analyse du fichier Tasks.json : {0}",
  "Failed to run test: {0}": "Échec de l’exécution du test : {0}",
  "Failed to set debugadpter directory": "Échec de la définition du répertoire debugadpter",
  "Failed to set extension directory": "Échec de la définition du répertoire d’extensions",
  "Failed to set install complete file path": "Échec de la définition du chemin d’accès complet à l’installation",
  "Failed to start debugger: {0}": "Échec du démarrage du débogueur : {0}",
  "Fix All Code Action": "Corriger toutes les actions de code",
  "Fix All: ": "Corriger tout : ",
  "Fix all issues": "Résoudre tous les problèmes",
  "Folder for trace file {0} does not exist": "Le dossier pour le fichier de trace {0} n’existe pas",
  "For further information visit {0}": "Pour plus d’informations, consultez {0}",
  "For further information visit {0}.": "Pour plus d’informations, consultez {0}.",
  "For more information about the 'console' field, see {0}": "Pour plus d’informations sur le champ « console », consultez {0}",
  "Generated document not found": "Document généré introuvable",
  "Get the SDK": "Obtention du Kit de développement logiciel (SDK)",
  "Go to GitHub": "Accéder à GitHub",
  "Go to output": "Accéder à la sortie",
  "Help": "Aide",
  "How to setup Remote Debugging": "Comment configurer le débogage à distance",
  "If you have changed target frameworks, make sure to update the program path.": "Si vous avez modifié la version cible de .Net Framework, veillez à mettre à jour le chemin d’accès du programme.",
  "Ignore": "Ignorer",
  "Ignoring non-parseable lines in envFile {0}: {1}.": "Lignes non analysables ignorées dans envFile {0} : {1}.",
  "Initializing dotnet-trace.../dotnet-trace is a command name and should not be localized": "Initialisation de dotnet-trace...",
  "Install": "Installer",
  "Installing dotnet-trace.../dotnet-trace is a command name and should not be localized": "Installation de dotnet-trace...",
  "IntelliCode features will not be available, {0} failed to activate.": "Les fonctionnalités IntelliCode ne seront pas disponibles, {0} n’a pas pu être activée.",
  "Invalid project index": "Index de projet non valide",
  "Is this a Bug or Feature request?": "S’agit-il d’une demande de bogue ou de fonctionnalité ?",
  "Language server process not found, ensure the server is running.": "Processus du serveur de langage introuvable. Vérifiez que le serveur est en cours d’exécution.",
  "Limited Activation": "Activation limitée",
  "Logs": "Journaux",
  "Machine information": "Informations sur l'ordinateur",
  "Manage": "Gérer",
  "More Detail": "Plus de détails",
  "More Information": "Plus d'informations",
  "Name not defined in current configuration.": "Nom non défini dans la configuration actuelle.",
  "Nested Code Action": "Action de code imbriqué",
  "No": "Non",
  "No executable projects": "Aucun projet exécutable",
  "No launchable target found for '{0}'": "Aucune cible pouvant être lancée n’a été trouvée pour « {0} »",
  "No launchable target found.": "Aucune cible pouvant être lancée n’a été trouvée.",
  "No process was selected.": "Aucun processus n’a été sélectionné.",
  "Non Razor file as active document": "Fichier non Razor comme document actif",
  "Not Now": "Pas maintenant",
  "OmniSharp": "OmniSharp",
  "OmniSharp Log": "Journal OmniSharp",
  "OmniSharp requires a complete install of Mono (including MSBuild) to provide language services when `omnisharp.useModernNet` is disabled in Settings. Please install the latest Mono and restart.": "OmniSharp nécessite une installation complète de Mono (Y compris MSBuild) pour fournir des services de langage lorsque « omnisharp.useModernNet » est désactivé dans Paramètres. Installez la dernière version de Mono et redémarrez.",
  "Open envFile": "Ouvrir envFile",
  "Open settings": "Ouvrir les paramètres",
  "Open solution": "Solution ouverte",
  "Operating system \"{0}\" not supported.": "Système d'exploitation \"{0}\" non pris en charge.",
  "Package {0} download from {1} failed integrity check. Some features may not work as expected. Please restart Visual Studio Code to retrigger the download": "Le téléchargement du package {0} à partir de {1} vérification d’intégrité a échoué. Certaines fonctionnalités peuvent ne pas fonctionner comme prévu. Veuillez redémarrer Visual Studio Code pour relancer le téléchargement",
  "Perform the actions (or no action) that resulted in your Razor issue": "Effectuez les actions (ou aucune action) ayant entraîné votre problème Razor",
  "Pick a fix all scope": "Choisir un correctif pour toutes les étendues",
  "Pipe transport failed to get OS and processes.": "Le transport de canal n'a pas pu obtenir le système d'exploitation et les processus.",
  "Please fill in this section": "Veuillez remplir cette section",
  "Press {0}": "Appuyez sur {0}",
  "Privacy Alert! The contents copied to your clipboard may contain personal data. Prior to posting to GitHub, please remove any personal data which should not be publicly viewable.": "Alerte de confidentialité ! Le contenu copié dans le Presse-papiers peut contenir des données personnelles. Avant de publier sur GitHub, supprimez toutes les données personnelles qui ne doivent pas être visibles publiquement.",
  "Projected CSharp document": "Document CSharp projeté",
  "Projected Html document": "Document HTML projeté",
  "Razor": "Razor",
  "Razor Log": "Journal de syntaxe Razor",
  "Razor document": "Document Razor",
  "Razor issue copied to clipboard": "Problème Razor copié dans le Presse-papiers",
  "Razor issue data collection started. Reproduce the issue then press \"Stop\"": "Collecte des données de problème Razor démarrée. Reproduisez le problème, puis appuyez sur « Arrêter »",
  "Razor issue data collection stopped. Copying issue content...": "La collecte des données de problème Razor s’est arrêtée. Copie du contenu du problème...",
  "Razor.VSCode version": "Version de Razor.VSCode",
  "Recording trace...": "Enregistrement de la trace...",
  "Reload C# Extension": "Recharger l'extension C#",
  "Reload Window": "Recharger la fenêtre",
  "Replace existing build and debug assets?": "Remplacer les ressources de build et de débogage existantes ?",
  "Report Razor Issue": "Signaler un problème Razor",
  "Report a Razor issue": "Signaler un problème Razor",
  "Required assets to build and debug are missing from '{0}'. Add them?": "Les ressources requises pour la génération et le débogage sont manquantes dans « {0} ». Les ajouter ?",
  "Restart Language Server": "Redémarrer le serveur de langue",
  "Restart server": "Redémarrer le serveur",
  "Restore": "Restaurer",
  "Restore already in progress": "La restauration est déjà en cours",
  "Restore {0}": "Restaurer {0}",
  "Run and Debug: A valid browser is not installed. Please install Edge or Chrome.": "Exécuter et déboguer : aucun navigateur valide n’est installé. Installez Edge ou Chrome.",
  "Run and Debug: auto-detection found {0} for a launch browser": "Exécuter et déboguer : détection automatique détectée {0} pour un navigateur de lancement",
  "Security Warning": "Avertissement de sécurité",
  "See {0} output": "Voir la sortie {0}",
  "Select Folder to Save Trace File": "Sélection du dossier pour l'enregistrement du fichier de trace",
  "Select Trace Folder": "Sélectionnez le dossier de trace",
  "Select fix all action": "Sélectionner corriger toutes les actions",
  "Select project": "Sélectionner un projet",
  "Select the process to attach to": "Sélectionner le processus à attacher",
  "Select the project to launch": "Sélectionner le projet à lancer",
  "Self-signed certificate successfully {0}": "Certificat auto-signé {0}",
  "Server stopped": "Serveur arrêté",
  "Show Output": "Afficher la sortie",
  "Some projects have trouble loading. Please review the output for more details.": "Certains projets rencontrent des problèmes de chargement. Pour plus d’informations, consultez la sortie.",
  "Start": "Début",
  "Startup project not set": "Projet de démarrage non défini",
  "Steps to reproduce": "Étapes à suivre pour reproduire",
  "Stop": "Arrêter",
  "Suppress notification": "Supprimer la notification",
  "Test run already in progress": "Série de tests déjà en cours",
  "Text editor must be focused to fix all issues": "L’éditeur de texte doit être axé sur la résolution de tous les problèmes",
  "The '{0}' command is not recommended to be used when C# Dev Kit extension is installed. Would you like build and debug using a dynamic configuration instead?": "La commande « {0} » n’est pas recommandée lors de l’installation de l’extension du Kit de développement C#. Voulez-vous générer et déboguer à l’aide d’une configuration dynamique à la place ?",
  "The .NET SDK cannot be located: {0}. .NET debugging will not be enabled. Make sure the .NET SDK is installed and is on the path.": "Le SDK .NET est introuvable : {0}. Le débogage .NET ne sera pas activé. Assurez-vous que le SDK .NET est installé et se trouve sur le chemin.",
  "The .NET SDK located on the path is too old. .NET debugging will not be enabled. The minimum supported version is {0}.": "Le SDK .NET situé sur le chemin est trop ancien. Le débogage .NET ne sera pas activé. La version minimale prise en charge est {0}.",
  "The C# extension for Visual Studio Code is incompatible on {0} {1} with the VS Code Remote Extensions. To see avaliable workarounds, click on '{2}'.": "L’extension C# pour Visual Studio Code est incompatible sur {0} {1} avec les extensions distantes VS Code. Pour voir les solutions de contournement disponibles, cliquez sur «{2}».",
  "The C# extension for Visual Studio Code is incompatible on {0} {1}.": "L’extension C# pour Visual Studio Code est incompatible sur {0} {1}.",
  "The C# extension is still downloading packages. Please see progress in the output window below.": "L’extension C# est toujours en train de télécharger des packages. Consultez la progression dans la fenêtre sortie ci-dessous.",
  "The C# extension was unable to automatically decode projects in the current workspace to create a runnable launch.json file. A template launch.json file has been created as a placeholder.\r\n\r\nIf the server is currently unable to load your project, you can attempt to resolve this by restoring any missing project dependencies (example: run 'dotnet restore') and by fixing any reported errors from building the projects in your workspace.\r\nIf this allows the server to now load your project then --\r\n  * Delete this file\r\n  * Open the Visual Studio Code command palette (View->Command Palette)\r\n  * run the command: '.NET: Generate Assets for Build and Debug'.\r\n\r\nIf your project requires a more complex launch configuration, you may wish to delete this configuration and pick a different template using the 'Add Configuration...' button at the bottom of this file.": "L’extension C# n’a pas pu décoder automatiquement les projets dans l’espace de travail actuel pour créer un fichier launch.json exécutable. Un fichier launch.json de modèle a été créé en tant qu’espace réservé.\r\n\r\nSi le serveur ne parvient pas actuellement à charger votre projet, vous pouvez tenter de résoudre ce problème en restaurant les dépendances de projet manquantes (par exemple, exécuter « dotnet restore ») et en corrigeant les erreurs signalées lors de la génération des projets dans votre espace de travail.\r\nSi cela permet au serveur de charger votre projet, --\r\n  * Supprimez ce fichier\r\n  * Ouvrez la palette de commandes Visual Studio Code (View->Command Palette)\r\n  * exécutez la commande : « .NET: Generate Assets for Build and Debug ».\r\n\r\nSi votre projet nécessite une configuration de lancement plus complexe, vous pouvez supprimer cette configuration et choisir un autre modèle à l’aide du bouton « Ajouter une configuration... » en bas de ce fichier.",
  "The active document is not part of the open workspace. Not all language features will be available.": "Le document actif ne fait pas partie de l’espace de travail ouvert. Toutes les fonctionnalités de langage ne seront pas disponibles.",
  "The selected launch configuration is configured to launch a web browser but no trusted development certificate was found. Create a trusted self-signed certificate?": "La configuration de lancement sélectionnée est configurée pour lancer un navigateur web, mais aucun certificat de développement approuvé n’a été trouvé. Créer un certificat auto-signé approuvé ?",
  "The value '{0}' for 'targetArchitecture' in launch configuraiton is invalid. Expected 'x86_64' or 'arm64'.": "La valeur « {0} » pour « Architecture cible » dans la configuration de lancement n'est pas valide. \"x86_64\" ou \"arm64\" attendu.",
  "The workspace is not trusted.": "L'espace de travail n'est pas approuvé.",
  "The {0} extension requires at least {1} of the .NET Install Tool ({2}) extension. Please update to continue": "L’extension {0} nécessite au moins la version {1} de l’extension Outil d’installation .NET ({2}). Effectuez une mise à jour pour continuer",
  "There are unresolved dependencies. Please execute the restore command to continue.": "Il existe des dépendances non résolues. Exécutez la commande de restauration pour continuer.",
  "There was an unexpected error while launching your debugging session. Check the console for helpful logs and visit the debugging docs for more info.": "Une erreur inattendue s’est produite lors du lancement de votre session de débogage. Consultez la console pour obtenir des journaux utiles et consultez les documents de débogage pour plus d’informations.",
  "Transport attach could not obtain processes list.": "L'attachement de transport n'a pas pu obtenir la liste des processus.",
  "Unable to determine RuntimeId. Please set 'targetArchitecture' in your launch.json configuration.": "Impossible de déterminer RuntimeId. Veuillez définir « targetArchitecture » dans votre configuration launch.json.",
  "Unable to determine a configuration for '{0}'. Please generate C# debug assets instead.": "Impossible de déterminer une configuration pour '{0}'. Veuillez plutôt générer des ressources de débogage C#.",
  "Unable to determine debug settings for project '{0}'": "Impossible de déterminer les paramètres de débogage pour le projet « {0} »",
  "Unable to find Razor extension version.": "La version de l’extension Razor est introuvable.",
  "Unable to generate assets to build and debug. {0}.": "Impossible de générer des ressources pour la génération et le débogage. {0}.",
  "Unable to launch Attach to Process dialog: ": "Impossible de lancer la boîte de dialogue Attacher au processus : ",
  "Unexpected RuntimeId '{0}'.": "RuntimeId « {0} » inattendu.",
  "Unexpected error when attaching to report Razor issue window.": "Erreur inattendue lors de l’attachement à la fenêtre de rapport du problème Razor.",
  "Unexpected message received from debugger.": "Message inattendu reçu du débogueur.",
  "Update and reload": "Mettre à jour et recharger",
  "Use IntelliSense to find out which attributes exist for C# debugging": "Utiliser IntelliSense pour déterminer quels attributs existent pour le débogage C#",
  "Use hover for the description of the existing attributes": "Utiliser le pointage pour la description des attributs existants",
  "VSCode version": "Version de VSCode",
  "Version": "Version",
  "Version {0} of the .NET Install Tool ({1}) was not found, {2} will not activate.": "La version {0} de l’outil d’installation .NET ({1}) est introuvable, {2} ne sera pas activé.",
  "View Debug Docs": "Afficher les documents de débogage",
  "WARNING": "AVERTISSEMENT",
  "Workspace information": "Informations sur l’espace de travail",
  "Workspace projects": "Projets de l’espace de travail",
  "Yes": "Oui",
  "You can modify the default arguments if needed": "Vous pouvez modifier les arguments par défaut si nécessaire",
  "You must first start the data collection before copying.": "Vous devez d’abord démarrer la collecte de données avant de la copier.",
  "You must first start the data collection before stopping.": "Vous devez commencer par démarrer la collecte de données avant de l’arrêter.",
  "Your workspace has multiple Visual Studio Solution files; please select one to get full IntelliSense.": "Votre espace de travail comporte plusieurs fichiers solution Visual Studio ; sélectionnez-en un pour obtenir intelliSense complet.",
  "[ERROR] The debugger cannot be installed. The debugger is not supported on '{0}'": "[ERREUR] Impossible d’installer le débogueur. Le débogueur n’est pas pris en charge sur « {0} »",
  "[ERROR] The debugger cannot be installed. The debugger requires {0} or newer.": "[ERREUR] Impossible d’installer le débogueur. Le débogueur nécessite des {0} ou plus récentes.",
  "[ERROR] The debugger cannot be installed. Unknown platform.": "[ERREUR] Impossible d’installer le débogueur. Plateforme inconnue.",
  "[ERROR]: C# Extension failed to install the debugger package.": "[ERREUR] : l’extension C# n’a pas pu installer le package du débogueur.",
  "[WARNING]: x86 Windows is not supported by the .NET debugger. Debugging will not be available.": "[AVERTISSEMENT] : Windows x86 n'est pas pris en charge par le débogueur .NET. Le débogage ne sera pas disponible.",
  "dotnet-trace not found, run \"{0}\" to install it?/dotnet-trace is a command name and should not be localized": "dotnet-trace introuvable, voulez-vous exécuter « {0} » pour l’installer ?",
  "dotnet.server.useOmnisharp option has changed. Please reload the window to apply the change": "l’option dotnet.server.useOmnzurp a changé. Rechargez la fenêtre pour appliquer la modification",
  "pipeArgs must be a string or a string array type": "pipeArgs doit être une chaîne ou un type de tableau de chaînes",
  "project.json is no longer a supported project format for .NET Core applications.": "project.json n’est plus un format de projet pris en charge pour les applications .NET Core.",
  "remote-attach": "remote-attach",
  "{0}, paste your issue contents as the body of the issue. Don't forget to fill out any details left unfilled.": "{0}, collez le contenu de votre problème en tant que corps du problème. N’oubliez pas de remplir tous les détails qui n’ont pas été remplis."
}