{
  "'{0}' is not an executable project.": "\"{0}\" não é um projeto executável.",
  "'{0}' request is not supported for the '{1}' configuration.": "'{0}' solicitação não tem suporte para a configuração '{1}' configuração.",
  "'{0}' was not provided in the debug configuration.": "'{0}' não foi fornecida na configuração de depuração.",
  "'{0}' was not set in the debug configuration.": "'{0}' foi definida na configuração de depuração.",
  ".NET NuGet Restore": "Restauração do .NET NuGet",
  ".NET Test Log": "Log de Teste do .NET",
  ".NET: Generate Assets for Build and Debug": ".NET: Gerar Ativos para Criação e Depuração",
  "A valid dotnet installation could not be found: {0}": "Não foi possível encontrar uma instalação dotnet válida: {0}",
  "Active File Context": "Contexto do Arquivo Ativo",
  "Actual behavior": "Comportamento real",
  "An error occurred during installation of the .NET Debugger. The C# extension may need to be reinstalled.": "Ocorreu um erro durante a instalação do Depurador do .NET. Talvez seja necessário reinstalar a extensão C#.",
  "Author": "Autor",
  "Bug": "Bug",
  "C# Activation Status": "Status de Ativação do C#",
  "C# LSP Trace Logs": "C# Logs de Rastreamento LSP",
  "C# Project Context Status": "Status do Contexto do Projeto do C#",
  "C# Workspace Status": "Status do workspace do C#",
  "C# configuration has changed. Would you like to relaunch the Language Server with your changes?": "A configuração do C# foi alterada. Gostaria de reiniciar o Language Server com suas alterações?",
  "C# configuration has changed. Would you like to reload the window to apply your changes?": "A configuração do C# foi alterada. Gostaria de recarregar a janela para aplicar suas alterações?",
  "Can not find an opened workspace folder. Please open a folder before starting to debug with a '{0}' configuration'.": "Não é possível localizar uma pasta de workspace aberta. Abra uma pasta antes de começar a depurar com uma configuração '{0}'.",
  "Can't parse envFile {0} because of {1}": "Não foi possível analisar o envFile {0} devido a {1}",
  "Cancel": "Cancelar",
  "Cannot create .NET debug configurations. No workspace folder was selected.": "Não foi possível criar configurações de depuração do .NET. Nenhuma pasta de workspace foi selecionada.",
  "Cannot create .NET debug configurations. The active C# project is not within folder '{0}'.": "Não foi possível criar configurações de depuração do .NET. O projeto C# ativo não está na pasta \"{0}\".",
  "Cannot create .NET debug configurations. The server is still initializing or has exited unexpectedly.": "Não foi possível criar configurações de depuração do .NET. O servidor ainda está sendo inicializado ou foi encerrado inesperadamente.",
  "Cannot load Razor OmniSharp language server because the directory was not found: '{0}'": "Não é possível carregar o servidor de linguagem Razor OmniSharp porque o diretório não foi encontrado: \"{0}\"",
  "Cannot resolve .NET debug configurations. The server is still initializing or has exited unexpectedly.": "Não foi possível resolver as configurações de depuração do .NET. O servidor ainda está sendo inicializado ou foi encerrado inesperadamente.",
  "Cannot start collecting Razor logs when {0} is set to {1}. Please open the output window, choose the \"Razor Log\", and use the gear icon to ensure the log level is set to \"Debug\" or \"Trace\".": "Não é possível começar a coletar logs do Razor quando {0} está definido como {1}. Abra a janela de saída, escolha o \"Log do Razor\" e use o ícone de engrenagem para garantir que o nível de log esteja definido como \"Depurar\" ou \"Rastrear\".",
  "Choose": "Escolher",
  "Choose and set default": "Escolher e definir o padrão",
  "Click {0}. This will copy all relevant issue information.": "Clique em {0}. Isso copiará todas as informações relevantes do problema.",
  "Configuration \"{0}\" in launch.json does not have a {1} argument with {2} for remote process listing.": "A configuração \"{0}\" no launch.json não tem um argumento {1} com {2} para fins de listagem de processos remotos.",
  "Copy issue content again": "Copie o conteúdo do problema novamente",
  "Could not determine CSharp content": "Não foi possível determinar o conteúdo do CSharp",
  "Could not determine CSharp content: {0}": "Não foi possível determinar o conteúdo CSharp: {0}",
  "Could not determine Html content": "Não foi possível determinar o conteúdo html",
  "Could not find '{0}' in or above '{1}'.": "Não foi possível encontrar '{0}' dentro ou acima '{1}'.",
  "Could not find a process id to attach.": "Não foi possível encontrar uma ID de processo para anexar.",
  "Could not locate .NET Core project in '{0}'. Assets were not generated.": "Não foi possível localizar o projeto .NET Core em “{0}”. Os ativos não foram gerados.",
  "Couldn't create self-signed certificate. See output for more information.": "Não foi possível criar um certificado autoassinado. Consulte a saída para obter mais informações.",
  "Couldn't create self-signed certificate. {0}\r\ncode: {1}\r\nstdout: {2}": "Não foi possível criar o certificado autoassinado. {0}\r\ncódigo: {1}\r\nstdout: {2}",
  "Description of the problem": "Descrição do problema",
  "Detected change in telemetry settings. These will not take effect until the language server is restarted, would you like to restart?": "Alteração detectada nas configurações de telemetria. Eles não entrarão em vigor até que o servidor de idiomas seja reiniciado, quer reiniciar?",
  "Disable message in settings": "Desabilitar uma mensagem nas configurações",
  "Dismiss": "Ignorar",
  "Do not load any": "Não carregue nenhum",
  "Do not show for this workspace": "Não mostrar para este workspace",
  "Does not contain .NET Core projects.": "Não contém projetos do .NET Core.",
  "Don't Ask Again": "Não perguntar novamente",
  "Download Mono": "Baixar Mono",
  "Enable launching a web browser when ASP.NET Core starts. For more information: {0}": "Habilitar a inicialização de um navegador da web quando o ASP.NET Core for iniciado. Para obter mais informações: {0}",
  "Enter dotnet-trace arguments/dotnet-trace is a command name and should not be localized": "Insira os argumentos do dotnet-trace",
  "Error Message: ": "Mensagem de Erro: ",
  "Expand": "Expandir",
  "Expected behavior": "Comportamento esperado",
  "Extension": "Extensão",
  "Extensions": "Extensões",
  "Failed to complete the installation of the C# extension. Please see the error in the output window below.": "Falha ao concluir a instalação da extensão C#. Confira o erro na janela de saída abaixo.",
  "Failed to execute dotnet-trace command: {0}/dotnet-trace is a command name and should not be localized": "Falha ao executar o comando dotnet-trace:{0}",
  "Failed to install dotnet-trace, it may need to be manually installed. See C# output for details./dotnet-trace is a command name and should not be localized": "Falha ao instalar o dotnet-trace; pode ser necessário instalá-lo manualmente. Veja a saída do C# para mais detalhes.",
  "Failed to parse tasks.json file: {0}": "Falha ao analisar o arquivo task.json: {0}",
  "Failed to run test: {0}": "Falha ao executar o teste: {0}",
  "Failed to set debugadpter directory": "Falha ao definir o diretório de depuração",
  "Failed to set extension directory": "Falha ao configurar o diretório da extensão",
  "Failed to set install complete file path": "Falha ao configurar o caminho do arquivo para concluir a instalação",
  "Failed to start debugger: {0}": "Falha ao iniciar o depurador: {0}",
  "Fix All Code Action": "Corrigir Todas as Ações de Código",
  "Fix All: ": "Corrigir Tudo: ",
  "Fix all issues": "Corrigir todos os problemas",
  "Folder for trace file {0} does not exist": "A pasta para o arquivo de rastreamento {0} não existe",
  "For further information visit {0}": "Para obter mais informações, acesse {0}",
  "For further information visit {0}.": "Para obter mais informações, visite {0}.",
  "For more information about the 'console' field, see {0}": "Para obter mais informações sobre o campo \"console\", confira {0}",
  "Generated document not found": "Documento gerado não encontrado",
  "Get the SDK": "Obter o SDK",
  "Go to GitHub": "Acessar o GitHub",
  "Go to output": "Ir para a saída",
  "Help": "Ajuda",
  "How to setup Remote Debugging": "Como configurar a Depuração Remota",
  "If you have changed target frameworks, make sure to update the program path.": "Se tiver alterado as estruturas de destino, certifique-se de atualizar o caminho do programa.",
  "Ignore": "Ignorar",
  "Ignoring non-parseable lines in envFile {0}: {1}.": "Ignorando linhas não analisáveis no envFile {0}: {1}.",
  "Initializing dotnet-trace.../dotnet-trace is a command name and should not be localized": "Inicializando dotnet-trace...",
  "Install": "Instalar",
  "Installing dotnet-trace.../dotnet-trace is a command name and should not be localized": "Instalando dotnet-trace...",
  "IntelliCode features will not be available, {0} failed to activate.": "Os recursos do IntelliCode não estarão disponíveis, {0} falha ao ativar.",
  "Invalid project index": "Índice de projeto inválido",
  "Is this a Bug or Feature request?": "Isso é uma solicitação de bug ou recurso?",
  "Language server process not found, ensure the server is running.": "Processo do servidor de linguagem não encontrado, certifique-se de que o servidor está em execução.",
  "Limited Activation": "Ativação Limitada",
  "Logs": "Logs",
  "Machine information": "Informações do computador",
  "Manage": "Gerenciar",
  "More Detail": "Mais Detalhes",
  "More Information": "Mais Informações",
  "Name not defined in current configuration.": "Nome não definido na configuração atual.",
  "Nested Code Action": "Ação de Código Aninhado",
  "No": "Não",
  "No executable projects": "Nenhum projeto executável",
  "No launchable target found for '{0}'": "Nenhum destino inicializável encontrado para \"{0}\"",
  "No launchable target found.": "Nenhum alvo inicializável encontrado.",
  "No process was selected.": "Nenhum processo foi selecionado.",
  "Non Razor file as active document": "Arquivo não Razor como documento ativo",
  "Not Now": "Agora não",
  "OmniSharp": "OmniSharp",
  "OmniSharp Log": "OmniSharp Log",
  "OmniSharp requires a complete install of Mono (including MSBuild) to provide language services when `omnisharp.useModernNet` is disabled in Settings. Please install the latest Mono and restart.": "O OmniSharp requer uma instalação completa do Mono (incluindo o MSBuild) para fornecer serviços de linguagem quando “omnisharp.useModernNet” estiver desabilitado nas Configurações. Instale o Mono mais recente e reinicie.",
  "Open envFile": "Abrir o envFile",
  "Open settings": "Abrir as configurações",
  "Open solution": "Abrir solução",
  "Operating system \"{0}\" not supported.": "Não há suporte para o sistema operacional \"{0}\".",
  "Package {0} download from {1} failed integrity check. Some features may not work as expected. Please restart Visual Studio Code to retrigger the download": "O download do pacote {0} a partir da verificação de integridade {1} falhou. É possível que alguns recursos não funcionem conforme o esperado. Reinicie o Visual Studio Code para reativar o download",
  "Perform the actions (or no action) that resulted in your Razor issue": "Execute as ações (ou nenhuma ação) que resultaram no problema do seu Razor",
  "Pick a fix all scope": "Escolher uma correção para todo o escopo",
  "Pipe transport failed to get OS and processes.": "O transporte de pipe falhou ao obter o SO e os processos.",
  "Please fill in this section": "Preencha esta seção",
  "Press {0}": "Pressione {0}",
  "Privacy Alert! The contents copied to your clipboard may contain personal data. Prior to posting to GitHub, please remove any personal data which should not be publicly viewable.": "Alerta de privacidade! O conteúdo copiado para a área de transferência pode conter dados pessoais. Antes de postar no GitHub, remova todos os dados pessoais que não devem ser visualizados publicamente.",
  "Projected CSharp document": "Documento CSharp projete",
  "Projected Html document": "Documento Html com Projeto",
  "Razor": "Razor",
  "Razor Log": "Razor Log",
  "Razor document": "Documento Razor",
  "Razor issue copied to clipboard": "Problema do Razor copiado para a área de transferência",
  "Razor issue data collection started. Reproduce the issue then press \"Stop\"": "A coleta de dados de problemas do Razor foi iniciada. Reproduza o problema e pressione \"Parar\"",
  "Razor issue data collection stopped. Copying issue content...": "A coleta de dados do problema do Razor foi interrompida. Copiando o conteúdo do problema...",
  "Razor.VSCode version": "Versão do Razor.VSCode",
  "Recording trace...": "Gravando rastreamento...",
  "Reload C# Extension": "Recarregar Extensão C#",
  "Reload Window": "Recarregar a Janela",
  "Replace existing build and debug assets?": "Substituir os ativos de compilação e depuração existentes?",
  "Report Razor Issue": "Relatar Problema do Razor",
  "Report a Razor issue": "Relatar um problema do Razor",
  "Required assets to build and debug are missing from '{0}'. Add them?": "Os ativos necessários para compilar e depurar estão ausentes de \"{0}\". Deseja adicioná-los?",
  "Restart Language Server": "Reiniciar o Servidor de Linguagem",
  "Restart server": "Reiniciar o servidor",
  "Restore": "Restaurar",
  "Restore already in progress": "Restauração já em andamento",
  "Restore {0}": "Restaurar {0}",
  "Run and Debug: A valid browser is not installed. Please install Edge or Chrome.": "Executar e depurar: um navegador válido não está instalado. Instale o Edge ou o Chrome.",
  "Run and Debug: auto-detection found {0} for a launch browser": "Executar e depurar: detecção automática encontrada {0} para um navegador de inicialização",
  "Security Warning": "Aviso de Segurança",
  "See {0} output": "Ver a saída de {0}",
  "Select Folder to Save Trace File": "Selecione a pasta para salvar o arquivo de rastreamento",
  "Select Trace Folder": "Selecionar Pasta de Rastreamento",
  "Select fix all action": "Selecionar corrigir todas as ações",
  "Select project": "Selecionar projeto",
  "Select the process to attach to": "Selecione o processo ao qual anexar",
  "Select the project to launch": "Selecione o projeto a ser iniciado",
  "Self-signed certificate successfully {0}": "Certificado autoassinado com sucesso {0}",
  "Server stopped": "Servidor parado",
  "Show Output": "Mostrar Saída",
  "Some projects have trouble loading. Please review the output for more details.": "Alguns projetos têm problemas ao serem carregados. Examine a saída para obter mais detalhes.",
  "Start": "Início",
  "Startup project not set": "Projeto de inicialização não configurado",
  "Steps to reproduce": "Etapas para reproduzir",
  "Stop": "Parar",
  "Suppress notification": "Suprimir notificação",
  "Test run already in progress": "A execução do teste já está em andamento",
  "Text editor must be focused to fix all issues": "O editor de texto deve estar focado para corrigir todos os problemas",
  "The '{0}' command is not recommended to be used when C# Dev Kit extension is installed. Would you like build and debug using a dynamic configuration instead?": "Não é recomendável usar o comando '{0}' quando a extensão C# Dev Kit está instalada. Deseja criar e depurar usando uma configuração dinâmica em vez disso?",
  "The .NET SDK cannot be located: {0}. .NET debugging will not be enabled. Make sure the .NET SDK is installed and is on the path.": "O SDK do .NET não pode ser localizado: {0}. A depuração do .NET não será habilitada. Verifique se o SDK do .NET está instalado e no caminho.",
  "The .NET SDK located on the path is too old. .NET debugging will not be enabled. The minimum supported version is {0}.": "O SDK do .NET localizado no caminho é muito antigo. A depuração do .NET não será habilitada. A versão mínima com suporte é {0}.",
  "The C# extension for Visual Studio Code is incompatible on {0} {1} with the VS Code Remote Extensions. To see avaliable workarounds, click on '{2}'.": "A extensão C# do Visual Studio Code é incompatível no {0} {1} com as Extensões VS Code Remotas. Para ver as soluções alternativas disponíveis, clique em “{2}”.",
  "The C# extension for Visual Studio Code is incompatible on {0} {1}.": "A extensão C# para Visual Studio Code é incompatível no {0} {1}.",
  "The C# extension is still downloading packages. Please see progress in the output window below.": "A extensão C# ainda está baixando pacotes. Veja o progresso na janela de saída abaixo.",
  "The C# extension was unable to automatically decode projects in the current workspace to create a runnable launch.json file. A template launch.json file has been created as a placeholder.\r\n\r\nIf the server is currently unable to load your project, you can attempt to resolve this by restoring any missing project dependencies (example: run 'dotnet restore') and by fixing any reported errors from building the projects in your workspace.\r\nIf this allows the server to now load your project then --\r\n  * Delete this file\r\n  * Open the Visual Studio Code command palette (View->Command Palette)\r\n  * run the command: '.NET: Generate Assets for Build and Debug'.\r\n\r\nIf your project requires a more complex launch configuration, you may wish to delete this configuration and pick a different template using the 'Add Configuration...' button at the bottom of this file.": "A extensão C# não conseguiu decodificar projetos automaticamente no workspace atual para criar um arquivo launch.json executável. Um modelo de arquivo launch.json foi criado como um espaço reservado.\r\n\r\nSe o servidor não estiver sendo capaz de carregar seu projeto no momento, você pode tentar resolver isso restaurando as dependências ausentes do projeto (por exemplo: executar \"dotnet restore\") e corrigindo quaisquer erros notificados com relação à compilação dos projetos no seu workspace.\r\nSe isso permitir que o servidor consiga carregar o projeto agora:\r\n  * Exclua esse arquivo\r\n  * Abra a paleta de comandos do Visual Studio Code (Ver->Paleta de Comandos)\r\n  * execute o comando: \".NET: Generate Assets for Build and Debug\".\r\n\r\nSe o seu projeto requerer uma configuração de inicialização mais complexa, talvez você queira excluir essa configuração e escolher um modelo diferente usando o botão \"Adicionar Configuração...\" na parte inferior desse arquivo.",
  "The active document is not part of the open workspace. Not all language features will be available.": "O documento ativo não faz parte do workspace aberto. Nem todos os recursos de linguagem estarão disponíveis.",
  "The selected launch configuration is configured to launch a web browser but no trusted development certificate was found. Create a trusted self-signed certificate?": "A configuração de inicialização selecionada está configurada para iniciar um navegador da web, mas nenhum certificado de desenvolvimento confiável foi encontrado. Deseja criar um certificado autoassinado confiável?",
  "The value '{0}' for 'targetArchitecture' in launch configuraiton is invalid. Expected 'x86_64' or 'arm64'.": "O valor “{0}” para “targetArchitecture” na configuração de inicialização é inválido. Esperado “x86_64” ou “arm64”.",
  "The workspace is not trusted.": "O espaço de trabalho não é confiável.",
  "The {0} extension requires at least {1} of the .NET Install Tool ({2}) extension. Please update to continue": "A extensão {0} requer pelo menos {1} da extensão .NET Install Tool ({2}). Atualize para continuar",
  "There are unresolved dependencies. Please execute the restore command to continue.": "Há dependências não resolvidas. Execute o comando de restauração para continuar.",
  "There was an unexpected error while launching your debugging session. Check the console for helpful logs and visit the debugging docs for more info.": "Ocorreu um erro inesperado ao iniciar sua sessão de depuração. Verifique o console para obter logs úteis e visite os documentos de depuração para obter mais informações.",
  "Transport attach could not obtain processes list.": "A anexação do transporte não pôde obter a lista de processos.",
  "Unable to determine RuntimeId. Please set 'targetArchitecture' in your launch.json configuration.": "Não foi possível determinar o RuntimeId. Defina “targetArchitecture” em sua configuração launch.json.",
  "Unable to determine a configuration for '{0}'. Please generate C# debug assets instead.": "Não foi possível determinar uma configuração para “{0}”. Em vez disso, gere ativos de depuração C#.",
  "Unable to determine debug settings for project '{0}'": "Não foi possível determinar as configurações de depuração para o projeto \"{0}\"",
  "Unable to find Razor extension version.": "Não é possível localizar a versão da extensão do Razor.",
  "Unable to generate assets to build and debug. {0}.": "Não foi possível gerar os ativos para compilar e depurar. {0}.",
  "Unable to launch Attach to Process dialog: ": "Não é possível iniciar a caixa de diálogo Anexar ao Processo: ",
  "Unexpected RuntimeId '{0}'.": "RuntimeId inesperada \"{0}\".",
  "Unexpected error when attaching to report Razor issue window.": "Erro inesperado ao anexar à janela de problema do Razor de relatório.",
  "Unexpected message received from debugger.": "Mensagem inesperada recebida do depurador.",
  "Update and reload": "Atualizar e recarregar",
  "Use IntelliSense to find out which attributes exist for C# debugging": "Usar o IntelliSense para descobrir quais atributos existem para a depuração de C#",
  "Use hover for the description of the existing attributes": "Passe o mouse sobre a tela para ver a descrição dos atributos existentes",
  "VSCode version": "Versão do VSCode",
  "Version": "Versão",
  "Version {0} of the .NET Install Tool ({1}) was not found, {2} will not activate.": "A versão {0} da Ferramenta de Instalação do .NET ({1}) não foi encontrada, {2} não será ativada.",
  "View Debug Docs": "Exibir Documentos de Depuração",
  "WARNING": "AVISO",
  "Workspace information": "Informações do workspace",
  "Workspace projects": "Projetos do espaço de trabalho",
  "Yes": "Sim",
  "You can modify the default arguments if needed": "Você pode modificar os argumentos padrão, se necessário",
  "You must first start the data collection before copying.": "Você deve primeiro iniciar a coleta de dados antes de copiar.",
  "You must first start the data collection before stopping.": "Você deve primeiro iniciar a coleta de dados antes de parar.",
  "Your workspace has multiple Visual Studio Solution files; please select one to get full IntelliSense.": "Seu workspace tem vários arquivos do Visual Studio de Solução; selecione um para obter o IntelliSense completo.",
  "[ERROR] The debugger cannot be installed. The debugger is not supported on '{0}'": "[ERRO] O depurador não pode ser instalado. O depurador não é compatível com “{0}”",
  "[ERROR] The debugger cannot be installed. The debugger requires {0} or newer.": "[ERRO] O depurador não pode ser instalado. O depurador requer {0} ou mais recente.",
  "[ERROR] The debugger cannot be installed. Unknown platform.": "[ERRO] O depurador não pôde ser instalado. Plataforma desconhecida.",
  "[ERROR]: C# Extension failed to install the debugger package.": "[ERRO]: a extensão C# falhou ao instalar o pacote do depurador.",
  "[WARNING]: x86 Windows is not supported by the .NET debugger. Debugging will not be available.": "[AVISO]: Windows x86 não dá suporte ao depurador .NET. A depuração não estará disponível.",
  "dotnet-trace not found, run \"{0}\" to install it?/dotnet-trace is a command name and should not be localized": "dotnet-trace não encontrado, executar \"{0}\" para instalá-lo?",
  "dotnet.server.useOmnisharp option has changed. Please reload the window to apply the change": "A opção dotnet.server.useOmnisharp foi alterada. Atualize a janela para aplicar a alteração",
  "pipeArgs must be a string or a string array type": "pipeArgs deve ser uma cadeia de caracteres ou um tipo de matriz de cadeia de caracteres",
  "project.json is no longer a supported project format for .NET Core applications.": "project.json não é mais um formato de projeto com suporte para os aplicativos .NET Core.",
  "remote-attach": "anexação-remota",
  "{0}, paste your issue contents as the body of the issue. Don't forget to fill out any details left unfilled.": "{0}, cole o conteúdo do problema como o corpo do problema. Não se esqueça de preencher todos os detalhes que não foram preenchidos."
}